performance-testing/mc-utils/src/test/resources/Search.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.9" jmeter="3.0 r1743807">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Search" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Cookie</stringProp>
            <stringProp name="Header.value">SMSESSION=6Qm3fuzEL2PqFHFJjmV1EH+gupwr04f8uMBYx++WlTDltFXLtQltfGVOIC6hVSP0/3Tf5rYPyEXW3sx7C1yfz1FvbAPEhalrdgg7sd2QSxqdq2slQSL15JVnJdSpLn3f/dkPSUjTZUEGfhkApaDzJ+yp0z8pRMw21tO/08Fu9NToT4CdQqWpvkusok5kirQaGLc49xB/zykmlsKiIVkafGjEfyJj6s/ZcrhS4PnKyvlorL1iIGuslXNZnMq/Xe6jz51Rsj75G76CjfKlOzeEzBe/bM+8ckfZ9j/mfMgm5NUe4xBIOLVrwvhDcRkI0OKHAV467stPoJ8sfI/+h8wlH1TCLPeenARoV2zBxpEQdeSnwcqv99n0zQbSEy4LPof7Fab4Yy1obHraJ2Fqwe4higFrm/QOzRLXpQ2PesCfH2uG6DDemC5IWnVFHD5mT1InVMNFndgJKMR+zwfGML7SCtBMqAEH7MG2iFLVeRTEpUAvmBN/Tuem3nPYDk4HG9iDJdMqowjXotF9TaCMWePcbsOJOfCx/ONus9m1FYutVvCVRM91UAuWM0LpuPWU5BRiR/yILSi3NqUIacILHlVDHXxNnUhbnT1ygiHULNx5aqMIhAdVSbORfEo4H+SU3Fa8Ur6leGMTHRfh4gHBrBYcnfff5G/GchHgTc3KKjFm86ouqajIygzd4evMm21picPCS1qAOJjjXfDkkOhk0GWGKeJqsf0yR+t7bH0aUiy0afkpvBA/TDejbC9hTSJQZCVBPFWtkVk+NJGCTXe0J3l4yXeoa4TrKz5me90U1odrOObBH6ZnBYf1IpTYfJeXeW4N0O0KnrWyCHrPQDLuASij8BjBxG0Vlx/YUXcXcT2j4gxhwUUV7XzO2uE75eSQRxDGQGinNKd8QV4jvMCKtEjzqJegXr/7Zg/81aZgj+dRV5PgOn1EMTDilVzO0W0vBAJGZcFwm+nq5gPwIMjGJ/DxGQhqJIk42bqc2f+zOi4a4j1apD66Gqd7g9g0bM2yvsP15Tx0UPBXGaZwC/M4quV7mOwknHAIOfEGb9UAT7xq1v3MI80sja5K/HpRgaMIGHX9WPHRNAlpLZ9KQkPn2CyfX/iap6xNgAuPQxJqQ3zgTubzYey3B6mbvTuOIYeGEcep; ACCESS_TOKEN=eyJjdHkiOiJhcHBsaWNhdGlvblwvSlNPTiIsImFsZyI6IlJTMjU2In0.eyJ0b2tlbiI6IlE4V2VCS3FBek9Za01UTC9NWXkyam1yeTZzamxnWFdmZHp6TkxzYW9xREppdU1FMnVOSDlDK3N5ZEtTcElBTVQ2QisyM01LR1FiVzlxdzUrWE10VGdFeit1UTdtUU5lMHptRFVZVmtKc0FuY3ZVWEhVdWdIL2V2WUpLd0E1NUhsREYydUNGb2dtNHZwYVIwQnJTKzF1K2lOVm8rdTJIRjZyaGtwUTEvR0M0NzJWdC9lYXZUOWVBd1B6SmVjUWRhNGx6MmtWR2l2TDBFdklSRUZEUjFCaWR1ZmpqVnJQSGxSSWVJM01DU3pRMTZWSUJkU1FqaHlVV2JVeGMvM2p4THJuOGtXelJ3SjgxSmRwZzhQUEwwQUducUY0NjFjdlVPNFpuMmlVdGw3SjhqUVpTcGswdUpqWDE1MHpTVkgyV0xlK2srYjJrY2M5TW1PWnFsWEM3WW9OcnU5VVQvdXVhakNVdndtTTFxbDBZRmYyNWtYTktJblM3NG5jUTArUE14bDNBU1Q2WDA3c3hMVXdaTHdveHVOV0hBdm1GaWZLUEJqaGhlTEpwVFpmVSs3UC9rQ0VVbEFsQTFoQUh1b3U5cGZvZlFFQU9YRnBoNmVoMUlYWDdpMG9QQ2VnbW9kNjRwL0o3aHZuN25VNUJEZVZxYlo4WGk2VGhKUEJPQTdxM283NjhxTXNlcEJhWjh0RHlJbDdhL0w1WWQ2Y3FwaVUya0lMRk44ODk3MlNHUlhRc2xvMXBhYkI3RUsrYnd5WWlBS2RqcnhTTC95TTQyOXZsWGc5ZGx3L1Zua2RnUlNhTFhrMEtQRllhN0lrTWgySVdGVlRtTGtvL3RnZ0FEZHRHM2ZyOU9zR2F0dUl5TzZNWGhjai9oeXRmbHJPL3dwUTFUcm8yei9JZE51YlJTY1IzOXBlN1pma1Zob0VEZ2dVUmtadU5LcHNaclpITmpUaXVienJsSFNJWmFNYWxvKzhVbGVCdHQxdEVQUTZBamlWcE91RFlSVzlPVWIvRUhabVN1WGN2QXhuUmh4cmxXNEplODAwZjJpcXc4UlFMUnBaclVVVDNTc3RZM1VKekZsbGRDWnRhYk1MNVdoT3pXS1dLUnM1d3lsR0hoZ0owMUZpRDUybWFDcmI2ZVZmcEd2UjdScndFdFlaMTFwTE1saTVQVS9VK3lNbjMrd1JqODBXUlMvdmZUMHFuMDhLdzlSbHU2KzdOaXdvcUxzSDNxczc2TUJtZFMvZUpWazhZdXZRWFFON3F3WU9FTzBUWlVjYXFDcExHWUcxazc1OGFQYzA3TnllSUNEeStleis3YnVFWnNvdHVhTTlXVWdNNWRaMnBTeURRU3pCdkhiMndpK1BUVUpicXRUSlg5RDE3Z1hnSWZMTTdQTW5rTlQ3MG5DRm9HM0FRWFNzYkduOEJXU3prWE9Bb2txVU9RY25wY29UQVNYZ2RJUmlOOHBKNHhDWkZVWkZoV1pKUUNTekJ0UFNDQjZJNXY5M21NU25yc2IzYTdCS2FodkZTN0Ywd0h4dmdQUExQelFNUGxKK01ZWExaVjB1ZWJTZlVTTVV5d0hSbWJPbndHOEVCeTFBaTIwekFocXJNckYrSkVtaXhCdXdDM2RiMkNUODFPdWVnRk0xclJUM05zZS9qWlBwdjB6RUR3YjRVdzcxS3dFSDlqMnlyVFk3YlNNTDR6bVhFTjJvZVA0dUhMREFsaTdrNHdoTHhleGllTXd2ZG5GTVRLT0JoV0xNZEprNHkzNGRvUkF6VkdvcmlHRGNUcWhBcjZveDZxd0orMDI4QTRUQmVjSkJHcEtIWXJEeVhxa2tGcWNiejlqR1lyOEkvcFFPN2syS3k1SmlBQlVWVXU5YXNyTFN5ODRHWUduZXoxUlJUYUoxMGVQR2J6MGtxYjgzSVgwYXNNVFBkRWNKR25XcUxHNVQ3dUNTSXpWMXFDTEF6M3ArVjdRLytmRVFQZEhjSUs2Tnl6elNZOGkwdDI4K1ZEdGVnZUVHU1BEMXNyVFZDYldncDRndzcrQmNaRE1ENldKY1ZVSnZLNWlQb2dFZkN5VG9ScWUzQ1ZPamFLYmpmL21LQ05xdXIyR1FYclVUVkRtc2ZsVmJTYWJXd25yZW5JOStKREVITWdMZG9landqMTRuYzEvRUtxMDRyemg0Y2JOa2o2SVNlSERHS28zTDROUzZtVnhON3daQ1lBbEY2UXRTeEUxWFEvZ2FWYy8yVmpRcE9wbVlMdUI2YjhBMVZCbDBkS0NhZFRaSk1TU094cGljeFdkMkpjakU5eWlqY0dwb0pVbE5HaGpuRlBRKzB5cXE5RWwwdTNQRHh6UUh2THVHaS9nWFpvOVE4VVY4QlFlVDBGVFlFbkEvL2w4M2taT3E0bEgiLCAiaXYiOiJxbWZKNGQzdU9QbUZFMS9ycURrVGd3PT0iLCAibWF4RXhwaXJhdGlvblRpbWUiOiIxNTA3OTM4NjkxNTI3In0.K_Wds4kygwCc2cEpiNPMaJpwSt4si2sL_8AIgL48h9Pmr2Ei1Q-4Ik2getQySnyACVmDeeFsAIUbWhoe6jc3bJFyoF2Y7EVTDivO_8Ol87-wS5AORk5m2c8IbbdNxCVAItwd5kPC7Bugoe4o-zOLiOkwE8crl2iHIrLy18IL4aEZV9EUz3BtW5QkGAjfRgQtBqfDD3gULfxOI4PEQExwH5p41p09hOdio6KbjiT0VOVxidpRCqnT2QRmJ3WdmmTGyAzUIE99zNF7GXThTm7HMBjiTqCI2yE3yEECSev1_rFTBJabQseRh5Wzix4ddzuoYJdBewJ2sS_ZhNRcyZEtoA; PROFILE_INFO={&quot;MSID&quot;:&quot;tnaraya1&quot;,&quot;userLastName&quot;:&quot;Narayana&quot;,&quot;roles&quot;:&quot;unx_ach_apsrp03596,unx_ach_apsrp03594,unx_ach_apsrp03591,unx_ach_apsrp03592,unx_ach_apsrp03527,unx_ach_apsrp03529,MC_DEV_OPS_STAGE,Users,MC_DEV_OPS_TEST,Users,MC_TESTING_TEST,Users,MC_TECH_ADMIN_TEST,Users,MC_TESTING_STAGE,Users,MC_TECH_ADMIN_STAGE,Users,SFLY_Testers_Admin,Users,unx_ach_apsrs6067,unx_ach_apsrs6063,unx_ach_apsrs6062,unx_ach_apsrs6061,unx_ach_apsrs6060,unx_ach_apsrs6059,unx_ach_apsrs6058,unx_ach_apsrs6053,unx_ach_apsrs6052,unx_ach_apsrs6048,unx_ach_apsrs6047,unx_ach_apsrs6046,unx_ach_apsrs6038,sfly_dev,unx_ach_apsrt3778,unx_ach_apsrt3774,unx_ach_apsrt3777,unx_ach_apsrt3776,unx_ach_apsrt3775,unx_ach_apsrt3773,unx_ach_apsrt3772,unx_ach_apsrt3771,unx_ach_apsrt3770,unx_ach_apsrt3769,unx_ach_apsrt3768,unx_ach_apsrt3767,unx_ach_apsrt3766,unx_ach_apsrt3763,unx_ach_apsrt3760,unx_ach_apsrt3761,unx_ach_apsrt3762,unx_ach_apsrt3759,Citrix_SimonTatham_PuTTY_066_A,Users,FulfillmentUI_AdminUser_NonProd,Users,FulfillmentUI_User_NonProd,Users,Citrix_MS_InternetExplorer_A,Users,Optum_services_repository,Users,Hard_Token_Users,Users,MOSS_HRdirect_ALL_CONTRACTORS,Users,VDI_2FactorAuth_Ext,Users,dce,CUCMCluster9,Users,CTX_Policy_Printing,Users,Citrix_MyAppsRemote,Users,Citrix_Common_Apps,Users&quot;,&quot;accessTokenType&quot;:&quot;USER&quot;,&quot;isOptumRole&quot;:true,&quot;userName&quot;:&quot;Thejaswi&quot;}</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Accept</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">30</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <longProp name="ThreadGroup.start_time">1507935688000</longProp>
        <longProp name="ThreadGroup.end_time">1507935688000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <stringProp name="ThreadGroup.duration">600</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="RequestId Search" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="searchCriteria" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">{&quot;size&quot;:,&quot;from&quot;:0,&quot;sort&quot;:[{&quot;request_date&quot;:{&quot;order&quot;:&quot;desc&quot;}}],&quot;query&quot;:{&quot;query_string&quot;:{&quot;default_operator&quot;:&quot;AND&quot;,&quot;analyze_wildcard&quot;:true,&quot;query&quot;:&quot;request_id_txt:${requestId}${counter_value}&quot;}}}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">searchCriteria</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">missioncontrol-tst.uhg.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">api/services/v1/search</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="requestId" elementType="Argument">
              <stringProp name="Argument.name">requestId</stringProp>
              <stringProp name="Argument.value">pt_pr_tid_06102017_2_</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Counter" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.end">7000</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">counter_value</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
        </CounterConfig>
        <hashTree/>
        <ResultSaver guiclass="ResultSaverGui" testclass="ResultSaver" testname="Save Responses to a file" enabled="false">
          <stringProp name="FileSaver.filename">search</stringProp>
          <boolProp name="FileSaver.errorsonly">false</boolProp>
          <boolProp name="FileSaver.skipautonumber">false</boolProp>
          <boolProp name="FileSaver.skipsuffix">false</boolProp>
          <boolProp name="FileSaver.successonly">false</boolProp>
          <boolProp name="FileSaver.addTimstamp">true</boolProp>
          <stringProp name="FileSaver.numberPadLen">5</stringProp>
        </ResultSaver>
        <hashTree/>
        <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
          <collectionProp name="Asserion.test_strings">
            <stringProp name="49586">200</stringProp>
          </collectionProp>
          <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
          <boolProp name="Assertion.assume_success">false</boolProp>
          <intProp name="Assertion.test_type">2</intProp>
        </ResponseAssertion>
        <hashTree/>
        <com.atlantbh.jmeter.plugins.jsonutils.jsonpathassertion.JSONPathAssertion guiclass="com.atlantbh.jmeter.plugins.jsonutils.jsonpathassertion.gui.JSONPathAssertionGui" testclass="com.atlantbh.jmeter.plugins.jsonutils.jsonpathassertion.JSONPathAssertion" testname="jp@gc - JSON Path Assertion" enabled="true">
          <stringProp name="JSON_PATH">$.hits.total</stringProp>
          <stringProp name="EXPECTED_VALUE">1</stringProp>
          <boolProp name="JSONVALIDATION">true</boolProp>
          <boolProp name="EXPECT_NULL">false</boolProp>
          <boolProp name="INVERT">false</boolProp>
          <boolProp name="ISREGEX">true</boolProp>
        </com.atlantbh.jmeter.plugins.jsonutils.jsonpathassertion.JSONPathAssertion>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="RespTimeGraph.interval">30000</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">searchresult.json</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer" enabled="true">
          <intProp name="calcMode">2</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>3000.0</value>
            <savedValue>0.0</savedValue>
          </doubleProp>
        </ConstantThroughputTimer>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>